import torch
import torch.nn.functional as F
input = [[[1.,1.,1.],
          [1.,1.,1.],
          [1.,1.,1.]],

         [[0.,0.,0.],
          [0.,0.,0.],
          [0.,0.,0.]]]
input = torch.tensor(input)

target = [[[1.,2.,3.],
           [4.,5.,6.],
           [7.,8.,9.]],

          [[11.,12.,13.],
           [14.,15.,16.],
           [17.,18.,19.]]]
target = torch.tensor(target)

loss = torch.nn.MSELoss(reduction='mean')
loss = loss(input, target)
print(loss)

# 下式最后除以2是指该函数输入的批大小为2；下式中除以9是指该函数输入的批数据中每个样本的元素个数为9。
mean_result = (   ((1.-1.)*1. + (2.-1.)*2. + (3.-1.)*3. + (4.-1.)*4. + (5.-1.)*5. + (6.-1.)*6. + (7.-1.)*7. + (8.-1.)*8. + (9.-1.)*9.)/9 +
                  (11.*11. + 12.*12. + 13.*13. + 14.*14. + 15.*15. + 16.*16. + 17.*17. + 18.*18. + 19.*19.)/9   ) \
              / 2
print(mean_result)
